Revit 2026 API

# Reference Class

---

A stable reference to a geometric object in a Revit model.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBReference

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class Reference : APIObject
```
```vb
Public Class Reference
	Inherits APIObject
```
```cpp
public ref class Reference : public APIObject
```
```fsharp
type Reference =
    class
        inherit APIObject
    end
```

The Reference type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Reference | Creates a Reference with the supplied element. |

|  | Name | Description |
| --- | --- | --- |
|  | ElementId | The element id for this reference. |
|  | ElementReferenceType | The type of reference. |
|  | GlobalPoint | The position on which the reference is hit. |
|  | IsReadOnly | Identifies if the object is read-only or modifiable.(Inherited from APIObject) |
|  | LinkedElementId | The id of the top-level element in the linked document that is referred to by this reference. |
|  | UVPoint | The UV parameters of the reference, if the reference contains a face. |

|  | Name | Description |
| --- | --- | --- |
|  | Contains | Checks if given reference identifies part of object identified by this reference. |
|  | ConvertToStableRepresentation | Converts the reference to a stable String representation. |
|  | CreateLinkReference | Creates a Reference from a Reference in an RVT Link. |
|  | CreateReferenceInLink | Creates a Reference in an RVT Link from a Reference in the RVT host file. |
|  | Dispose | Causes the object to release immediately any resources it may be utilizing.(Inherited from APIObject) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | EqualTo | Checks if given reference is equal to this reference. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ParseFromStableRepresentation | Converts a stable String representation of a reference to a Reference object. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB Namespace